"SERVER_ERROR_DESCRIPTION" = "Newsletter Subscription Failed";
"SERVER_ERROR_FAILURE_REASON" = "Server did not respond with success.";
"SERVER_ERROR_RECOVERY_SUGGESTION" = "You could not be subscribed to our newsletter. Please try again later or contact our support.";

"ALREADY_SUBSCRIBED_DESCRIPTION" = "You are already subscribed";
"ALREADY_SUBSCRIBED_FAILURE_REASON" = "Server did not respond with success.";
"ALREADY_SUBSCRIBED_RECOVERY_SUGGESTION" = "You are already subscribed to this newsletter.";
